Repository: ArkDeck/ArkDeck
Catalog: ArkDeckApp/Resources/TraceViewerLocalizable.xcstrings
Source language: en
Languages: de, zh_hans

source: ArkTrace and third-party license notices
de: ArkTrace- und Drittanbieter-Lizenzhinweise
zh_hans: ArkTrace 与第三方许可证声明

source: Dock Inspector
de: Informationsbereich andocken
zh_hans: 停靠检查器

source: Dock to Bottom
de: Unten andocken
zh_hans: 停靠在底部

source: Dock to Right
de: Rechts andocken
zh_hans: 停靠在右侧

source: Hide Inspector
de: Informationsbereich ausblenden
zh_hans: 隐藏检查器

source: Show Inspector
de: Informationsbereich wieder einblenden
zh_hans: 显示检查器

# a11y.announce.openingCancelled
source: Opening cancelled
de: Öffnen abgebrochen
zh_hans: 已取消打开

# a11y.announce.openingTrace
source: Opening trace
de: Trace wird geöffnet
zh_hans: 正在打开 Trace

# a11y.announce.operationFailed
source: Operation failed
de: Vorgang fehlgeschlagen
zh_hans: 操作失败

# a11y.announce.rangeAnalysisComplete
source: Range analysis complete
de: Bereichsanalyse abgeschlossen
zh_hans: 范围分析完成

# a11y.announce.searchFoundAtLeastResults
source: Search found at least %lld results
de: Suche fand mindestens %lld Ergebnisse
zh_hans: 搜索找到至少 %lld 个结果

# a11y.announce.searchFoundResults
source: Search found %lld results
de: Suche fand %lld Ergebnisse
zh_hans: 搜索找到 %lld 个结果

# a11y.announce.traceCloseFailed
source: Trace close failed
de: Schließen des Trace fehlgeschlagen
zh_hans: 关闭 Trace 失败

# a11y.announce.traceClosed
source: Trace closed
de: Trace geschlossen
zh_hans: 已关闭 Trace

# a11y.announce.traceLoadedWithVisibleTracks
source: Trace loaded, %lld visible tracks
de: Trace geladen, %lld sichtbare Spuren
zh_hans: Trace 已加载，有 %lld 个可见轨道

# a11y.announce.traceLoadedWithoutTimedEvents
source: Trace loaded, no timed events
de: Trace geladen, keine zeitbehafteten Ereignisse
zh_hans: Trace 已加载，没有带时刻的事件

# a11y.announce.traceOpenFailed
source: Trace failed
de: Trace fehlgeschlagen
zh_hans: Trace 加载失败

# a11y.timeline.label
source: Trace Timeline
de: Trace-Zeitleiste
zh_hans: Trace 时间轴

# error.title.bundledParserUnavailable
source: Bundled parser is unavailable
de: Fehler: Mitgelieferter Parser ist nicht verfügbar
zh_hans: 内置解析器不可用

# error.title.cacheNeedsAttention
source: Trace cache needs attention
de: Fehler: Trace-Cache erfordert Aufmerksamkeit
zh_hans: Trace 缓存需要处理

# error.title.couldNotFinish
source: ArkTrace could not finish
de: Fehler: ArkTrace konnte nicht abschließen
zh_hans: ArkTrace 未能完成操作

# error.title.openingCancelled
source: Opening was cancelled
de: Fehler: Öffnen wurde abgebrochen
zh_hans: 已取消打开

# error.title.traceCouldNotBeOpened
source: Trace could not be opened
de: Fehler: Trace konnte nicht geöffnet werden
zh_hans: 无法打开 Trace

source: Search TID, thread, or slice
zh_hans: 搜索 TID、线程或 slice

source: Capture
zh_hans: 采集

source: Capture a trace from a connected OpenHarmony device
zh_hans: 从已连接的 OpenHarmony 设备采集 Trace

source: Open
zh_hans: 打开

source: Open Trace…
zh_hans: 打开 Trace…

source: Capture Trace…
zh_hans: 采集 Trace…

source: Reload Trace
zh_hans: 重新加载 Trace

source: Filter Trace Processes
zh_hans: 筛选 Trace 进程

source: Trace Keyboard Shortcuts
zh_hans: Trace 键盘快捷键

source: Unpin lane
zh_hans: 取消固定轨道

source: Pin lane
zh_hans: 固定轨道

source: In the pinned area
zh_hans: 位于固定区域

source: Remove from Recent
zh_hans: 从最近记录移除

source: Show in Finder
zh_hans: 在 Finder 中显示

source: Recent
zh_hans: 最近打开

source: Filter by process name or PID
zh_hans: 按进程名称或 PID 筛选

source: Filter processes by name or PID
zh_hans: 按名称或 PID 筛选进程

source: Stop filtering
zh_hans: 停止筛选

source: Stop filtering processes
zh_hans: 停止筛选进程

source: Filter processes
zh_hans: 筛选进程

source: Pinned
zh_hans: 已固定

source: No process matches the filter
zh_hans: 没有符合筛选条件的进程

source: Not available in this trace
zh_hans: 此 Trace 中不可用

source: No matching tracks
zh_hans: 没有匹配的轨道

source: Show these lanes in the timeline
zh_hans: 在时间轴中显示这些轨道

source: Search Results
zh_hans: 搜索结果

source: No matches
zh_hans: 没有匹配项

source: More matches exist
zh_hans: 还有更多匹配项

source: Open a trace
zh_hans: 打开 Trace

source: Open, drop, or choose a recent .htrace/.ftrace/.systrace file.
zh_hans: 打开或拖入 .htrace/.ftrace/.systrace 文件，也可选择最近打开的文件。

source: The trace could not be opened.
zh_hans: 无法打开此 Trace。

source: Cancel
zh_hans: 取消

source: Opening cancelled
zh_hans: 已取消打开

source: Copying trace…
zh_hans: 正在复制 Trace…

source: Inspector
zh_hans: 检查器

source: Hover
zh_hans: 悬停事件

source: Select an event or drag a time range.
zh_hans: 选择事件或拖动选取时间范围。

source: Retry
zh_hans: 重试

source: Choose Another File…
zh_hans: 选择其他文件…

source: Cache Settings…
zh_hans: 缓存设置…

source: Reload
zh_hans: 重新加载

source: Zoom Selection
zh_hans: 缩放到选区

source: Zoom In
zh_hans: 放大

source: Zoom Out
zh_hans: 缩小

source: Reset Zoom
zh_hans: 重置缩放

source: Tag
zh_hans: 标签

source: Change Colour
zh_hans: 更改颜色

source: Remove
zh_hans: 移除

source: Annotations
zh_hans: 注释

source: Saved with this trace — they return when you reopen it.
zh_hans: 注释随此 Trace 保存在本机，重新打开时仍会显示。

source: Click the time ruler to place a flag.
zh_hans: 点击时间标尺可添加时刻标记。

source: Flags
zh_hans: 时刻标记

source: Marks
zh_hans: 区间标记

source: Name
zh_hans: 名称

source: Flatten call depth
zh_hans: 折叠调用层级

source: Show call depth
zh_hans: 显示调用层级

source: Expanded
zh_hans: 已展开

source: Flattened
zh_hans: 已折叠

source: Identity
zh_hans: 标识

source: Start
zh_hans: 开始

source: End
zh_hans: 结束

source: Duration
zh_hans: 时长

source: Open ended
zh_hans: 结束时刻未记录

source: Process key
zh_hans: 进程键

source: Thread key
zh_hans: 线程键

source: Process
zh_hans: 进程

source: Thread
zh_hans: 线程

source: Category
zh_hans: 类别

source: State
zh_hans: 状态

source: Priority
zh_hans: 优先级

source: Value
zh_hans: 值

source: Unit
zh_hans: 单位

source: Arguments
zh_hans: 参数

source: More arguments exist
zh_hans: 还有更多参数

source: Total
zh_hans: 总计

source: Avg
zh_hans: 平均

source: Count
zh_hans: 次数

source: Selected Range
zh_hans: 选中范围

source: CPU Utilization
zh_hans: CPU 使用率

source: Top Threads
zh_hans: 主要线程

source: Thread States
zh_hans: 线程状态

source: No thread state intervals in this range.
zh_hans: 此范围内没有线程状态区间。

source: Thread states reached their interval budget
zh_hans: 线程状态读取已达到区间数量上限

source: Slices by Name
zh_hans: 按名称统计切片

source: No named slices in this range.
zh_hans: 此范围内没有具名切片。

source: Totals are a lower bound: slice page reached its budget
zh_hans: 统计值为下界：切片读取已达到分页上限

source: Reveals the first occurrence on the timeline
zh_hans: 在时间轴上显示首次出现的位置

source: Long Slices
zh_hans: 长切片

source: Analysis is a bounded lower estimate
zh_hans: 分析受读取上限限制，结果为下界估计

source: Analyzing range…
zh_hans: 正在分析范围…

source: Timeline shortcuts act on the focused timeline, so typing in the search field stays typing.
zh_hans: 时间轴快捷键仅在时间轴获得焦点时生效，不影响搜索框输入。

source: Cache
zh_hans: 缓存

source: Licenses
zh_hans: 许可证

source: Trace settings section
zh_hans: Trace 设置分区

source: Content-addressed Cache
zh_hans: 按内容寻址的缓存

source: Size
zh_hans: 大小

source: Entries
zh_hans: 条目

source: In use
zh_hans: 使用中

source: Refresh
zh_hans: 刷新

source: Purge Unused Entries
zh_hans: 清理未使用条目

source: ArkTrace only purges inactive derived databases. Original trace files are never cache targets.
zh_hans: ArkTrace 仅清理未使用的派生数据库，不会删除原始 Trace 文件。

source: Open Source Licenses
zh_hans: 开源许可证

source: ArkTrace includes a pinned TraceStreamer build and its reviewed source closure.
zh_hans: ArkTrace 包含固定版本的 TraceStreamer 构建及已审查的源码依赖。

source: ArkTrace — MIT License
zh_hans: ArkTrace — MIT 许可证

source: Loading license…
zh_hans: 正在加载许可证…

source: Third-Party Notices
zh_hans: 第三方声明

source: Loading notices…
zh_hans: 正在加载声明…

source: Show License Files in Finder
zh_hans: 在 Finder 中显示许可证文件

source: 14 reviewed components
zh_hans: 14 个已审查组件

source: License resources are unavailable in this build.
zh_hans: 此构建未提供许可证资源。

source: Preparing…
zh_hans: 正在准备…

source: Snapshotting trace…
zh_hans: 正在创建 Trace 快照…

source: Checking cache…
zh_hans: 正在检查缓存…

source: Parsing trace…
zh_hans: 正在解析 Trace…

source: Validating database…
zh_hans: 正在验证数据库…

source: Preparing indexes…
zh_hans: 正在准备索引…

source: Opening database…
zh_hans: 正在打开数据库…

source: Ready
zh_hans: 就绪

source: Failed
zh_hans: 失败

source: Cancelled
zh_hans: 已取消

source: Search events
zh_hans: 搜索事件

source: Search trace events
zh_hans: 搜索 Trace 事件

source: Some lanes are not listed: this trace has more threads or counter series than the list holds
zh_hans: 部分轨道未列出：此 Trace 的线程或计数器序列超过列表上限

source: Unpin {name}
zh_hans: 取消固定 {name}

source: Pin {name}
zh_hans: 固定 {name}

source: {name}, missing
zh_hans: {name}，文件缺失

source: Missing — {path}
zh_hans: 文件缺失 — {path}

source: {position} of {count}{suffix}
zh_hans: 第 {position} 项，共 {count}{suffix} 项

source: Change colour of {name}
zh_hans: 更改 {name} 的颜色

source: Rename {name}
zh_hans: 重命名 {name}

source: Delete {name}
zh_hans: 删除 {name}

source: Flatten call depth for {name}
zh_hans: 折叠 {name} 的调用层级

source: Show call depth for {name}
zh_hans: 显示 {name} 的调用层级

source: {duration} · {percentage} · intervals: {count}
zh_hans: {duration} · {percentage} · 区间数：{count}

source: {thread}, state {state}
zh_hans: {thread}，状态 {state}

source: {duration}, {percentage} of range, intervals: {count}
zh_hans: {duration}，占范围的 {percentage}，区间数：{count}

source: Thread states: {shown} / {total}
zh_hans: 线程状态：{shown} / {total}

source: {total} · avg {average} · ×{count}
zh_hans: {total} · 平均 {average} · ×{count}

source: total {total}, average {average}, occurrences: {count}
zh_hans: 总计 {total}，平均 {average}，次数：{count}

source: Slice names: {shown} / {total}
zh_hans: 切片名称：{shown} / {total}

source: Sort slices by {name}
zh_hans: 按 {name} 对切片排序

# viewer.eventType
source: Type
zh_hans: 类型

# viewer.openPanel.title
source: Open Trace
zh_hans: 打开 Trace

# viewer.searchEvents.menu
source: Search Trace Events
zh_hans: 搜索 Trace 事件

source: Trace unavailable
zh_hans: Trace 不可用

source: Hit
zh_hans: 命中

source: Miss
zh_hans: 未命中

source: Diagnostics
zh_hans: 诊断详情

source: {name} (temporary)
zh_hans: {name}（临时）

source: {share} · {count} slices
zh_hans: {share} · {count} 个切片

# error.reason.chooseFile
source: The source could not be read or validated. Choose an accessible trace file.
zh_hans: 源文件无法读取或校验。请选择一个可访问的 Trace 文件。

# error.reason.parser
source: The bundled parser could not be verified or started. Check the diagnostic details before retrying.
zh_hans: 内置解析器未通过校验或无法启动。请查看诊断详情后重试。

# error.reason.cache
source: The derived trace cache needs attention. Inspect it in Trace settings; the original trace is not a cache target.
zh_hans: Trace 派生缓存需要处理。请在 Trace 设置中检查；原始 Trace 不属于缓存清理范围。

# error.reason.cancelled
source: Opening was cancelled. No new trace was opened.
zh_hans: 打开操作已取消，没有打开新的 Trace。

# error.reason.operation
source: The trace operation did not finish. Review the diagnostic details and the available recovery action.
zh_hans: Trace 操作未完成。请查看诊断详情和当前可用的处理方式。

source: CPU Counters
zh_hans: CPU 计数器

source: Unattributed
zh_hans: 未归属

source: Source bytes
zh_hans: 源文件大小

source: Schema
zh_hans: Schema 指纹
